Merge branch 'master' into develop
# Conflicts:
#	CMakeLists.txt
#	include/plog/Appenders/DebugOutputAppender.h
#	include/plog/Appenders/RollingDateFileAppender.h
#	include/plog/Record.h
#	include/plog/Util.h
#	samples/RollingDateFileAppender/Main.cpp
