--- a/README.md
+++ b/README.md
@@ -546,19 +551,12 @@ There are 5 functional parts:
 
-![Log data flow](http://gravizo.com/g?@startuml;%28*%29%20-r->%20"PLOG%20macro";-r->%20"Record";-r->%20"Logger";-r-->%20"Appender";-d->%20"Formatter";-d->%20"Converter";-u->%20"Appender";-r->%20%28*%29;@enduml)
-<!--
-@startuml
-(*) -r-> "PLOG macro"
--r-> "Record"
--r-> "Logger"
--r-> "Appender"
--d-> "Formatter"
--d-> "Converter"
--u-> "Appender"
--r-> (*)
-@enduml
--->
+```mermaid
+flowchart LR;
+    ST((start)) --> P[PLOG macro] --> R[Record] --> L[Logger] --> A[Appender]
+    A -->|record| F[Formatter] -->|text| C[Converter] -->|binary| A
+    A --> FIN(((finish)))
+```
 
 ## Logger
 [Logger](#logger) is a center object of the whole logging system. It is a singleton and thus it forms a known single entry point for configuration and processing log data. [Logger](#logger) can act as [Appender](#appender) for another [Logger](#logger) because it implements `IAppender` interface. Also there can be several independent loggers that are parameterized by an integer instanceId number. The default instanceId is 0.
